dangernoodle-io/breadboard/examples/floor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary. See components/bb_health/Kconfig.
# Original ESP32 has no assist-debug module (SOC_ASSIST_DEBUG_SUPPORTED is
# unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD isn't available here -- the
# end-of-stack hardware watchpoint below is the best deterministic (not
# sampled-at-context-switch) detection this chip offers.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3

# HW-validation gate for the per-task stack high-water console report (PR
# #1130): uxTaskGetSystemState() -- the API bb_task_registry_base_scan.c
# uses to sample per-task stack high-water marks -- is only compiled in by
# FreeRTOS when this is set; without it the base scan is a no-op stub and
# every report row renders unsampled (budget-only, no free/used bytes).
# floor-only: this is a bench-measurement opt-in, not a shipping default.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# FOUNDATIONAL FLOOR (jae/autowire-sweep): all bb_log sinks off -- this is the
# true floor, console logging only. bb_log's CMakeLists REQUIRES are now
# Kconfig-conditional to match these gates (see components/bb_log/CMakeLists.txt),
# so leaving these =n also shrinks the component-discovery closure itself,
# not just the compiled sources.
CONFIG_BB_LOG_ROUTES=n
CONFIG_BB_LOG_UDP_SINK=n

# Free size win: smallest floor, not fastest.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# INTERIM scaffold (B1-1077): bb_diag dispatcher needs ~7.5KB stack
# (storage/nvs worst-case); right-size or move buffers to heap once the
# full /api/diag surface is migrated + measured.
CONFIG_BB_HTTP_TASK_STACK_SIZE=16384

# PR6 (floor HW-validation gate): opt in to the destructive
# POST /api/diag/factory-reset route (default n) so floor's bench board
# can validate the full diag/storage HTTP surface end to end.
CONFIG_BB_STORAGE_HTTP_FACTORY_RESET=y

# B1-1275: disable WPA2/WPA3-Enterprise WiFi -- the enterprise (802.1X/EAP)
# connection path is unused (no esp_wifi_sta_enterprise_*/esp_eap_client_*
# call sites); this shrinks compiled-in attack surface, not flash --
# linker --gc-sections was already stripping most of the dead code, so the
# measured delta is negligible either way (esp32 +168B, esp32c3 -722B).
# TLS, the mbedTLS cert bundle, and WPA3-Personal/SAE
# (CONFIG_ESP_WIFI_ENABLE_WPA3_SAE) are untouched.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
